app/views/users/show.html.erb

SELECT  "users".* FROM "users"  WHERE "users"."id" = $1 LIMIT 1  [["id", 4]]
---
      </br>
      <h1 class="content-head is-center"><img src="<%=User.find(current_user.id).gravatar_url%>"></h1>

SELECT  "random_challenges".* FROM "random_challenges"  WHERE "random_challenges"."id" = $1 LIMIT 1  [["id", 5]]
---
        <tr>
          <td><%= RandomChallenge.find(challenge.random_challenge_id).truth %></td>