app/views/challenges/accept.html.erb

    </br>
    <h1 class="content-head is-center"><img src="<%=User.find(current_user.id).gravatar_url%>"></h1>
---
SELECT  "users".* FROM "users"  WHERE "users"."id" = $1 LIMIT 1  [["id", 4]]